#+STARTUP: customtime
#+HUGO_BASE_DIR: ./website/
#+HUGO_SECTION: assignment
#+HUGO_STATIC_IMAGES: Images
#+HUGO_MENU: :menu main :parent Assignments
#+HUGO_AUTO_SET_LASTMOD: t
#+CATEGORY: assignments
#+TAGS: 
#+DESCRIPTION: 
#+TITLE: Assignments
#+HUGO_MENU: :menu main :parent Assignments
#+HUGO_AUTO_SET_LASTMOD: t
#+ORG_LMS_COURSEID: 89033
#+PROPERTY: :header-args :results code

* testing assignment map

#+begin_src emacs-lisp
(defun ol-assignment-map-internal ()
    (interactive)
  (let* ((id (org-lms-get-keyword "ORG_LMS_COURSEID"))
         (results '())
         (org-use-tag-inheritance nil)
         )
    ;; (message "BUFFER STRING SHOULD BE: %s" (buffer-string))
    (setq results 
          (org-map-entries
           (lambda ()
             (let* ((rubric )
                    (name (nth 4 (org-heading-components)))
                    (a-symbol (intern (or (org-entry-get nil  "ORG_LMS_ANAME") 
                                          (replace-regexp-in-string "[ \n\t]" "" name)))))
               (setq rubric  (car (org-map-entries
                                   (lambda ()
                                     (let ((e (org-element-at-point )))
                                       ;; in case at some point we would rather have thewhole element (scary)
                                       ;; (org-element-at-point)
                                       (buffer-substring-no-properties
                                        (org-element-property :contents-begin e)
                                        (org-element-property :contents-end e))
                                       )) "rubric" 'tree))  )
               ;; hopefully nothing broeke here w/ additions <2018-11-16 Fri>
               `(,a-symbol .  (:courseid ,id :canvasid ,(org-entry-get nil "CANVASID")
                                         :due-at ,(org-entry-get nil "DUE_AT") :html_url ,(org-entry-get nil "CANVAS_HTML_URL")
                                         :name ,(nth 4 (org-heading-components)  ) 
                                         :submission_type ,(or (org-entry-get nil "SUBMISSION_TYPE") "online_upload") 
                                         :published ,(org-entry-get nil "OL_PUBLISH")
                                         :submission_url ,(org-entry-get nil "CANVAS_SUBMISSION_URL")
                                         :basecommit ,(org-entry-get nil "BASECOMMIT")
                                         :grade_type "letter_grade" ;; oops fix this!
                                         :assignment-type ,(org-entry-get nil "ASSIGNMENT_TYPE")
                                         :directory ,(or (org-entry-get nil "OL_DIRECTORY")
                                                         (downcase
                                                          (replace-regexp-in-string "[\s]" "-" name )))
                                         :rubric ,rubric)))
             ) "assignment"))
    ;;(message "RESULT IS: %s" results)
    results))
#+end_src
#+begin_src emacs-lisp
(ol-assignment-map-internal)
#+end_src

#+RESULTS:
| COMMENT2019MidtermExam1   | :courseid | 89033 | :canvasid | 133261 | :due-at | 2019-02-08 | :html_url | https://q.utoronto.ca/courses/89033/assignments/133261 | :name | COMMENT 2019 Midterm Exam 1  | :submission_type | online_upload | :published | t | :submission_url | https://q.utoronto.ca/courses/89033/assignments/133261/submissions?zip=1 | :basecommit | none | :grade_type | letter_grade | :assignment-type | canvas | :directory | comment-2019-midterm-exam-1  | :rubric | - Grade :: |
| 2019Midterm2              | :courseid | 89033 | :canvasid | 146418 | :due-at | 2019-03-21 | :html_url | https://q.utoronto.ca/courses/89033/assignments/146418 | :name | 2019 Midterm 2               | :submission_type | online_upload | :published | t | :submission_url | https://q.utoronto.ca/courses/89033/assignments/146418/submissions?zip=1 | :basecommit | none | :grade_type | letter_grade | :assignment-type | canvas | :directory | 2019-midterm-2               | :rubric | - Grade :: |
| 2019ResearchPaperProposal | :courseid | 89033 | :canvasid | 146525 | :due-at | 2019-03-27 | :html_url | https://q.utoronto.ca/courses/89033/assignments/146525 | :name | 2019 Research Paper Proposal | :submission_type | online_upload | :published | t | :submission_url | https://q.utoronto.ca/courses/89033/assignments/146525/submissions?zip=1 | :basecommit | none | :grade_type | letter_grade | :assignment-type | canvas | :directory | 2019-research-paper-proposal | :rubric | - Grade :: |

